/********************************************************************/
/*							インクルード							*/
/********************************************************************/
#include "C8H10N4O2/Include.h"

/********************************************************************/
/*							プロトタイプ宣言						*/
/********************************************************************/

/*********************************************************************
			＠実行順について

	initializationProcessBeforeLoop
			↓
	debugModeInitializationProcessBeforeLoop(デバック時のみ)
			↓	(ループ開始)
	SceneManager::edit
			↓
	updateProcess
			↓
	debugModeUpdateProcess(デバック時のみ)
			↓
	SceneManager::render
			↓
	drawingProcess
			↓
	debugModeDrawingProcess(デバック時のみ)
			↓	(ループ終了)
	SceneManager::release
			↓
	endProcessAfterTheLoopEnds
			↓
	debugModeEndProcessAfterTheLoopEnds(デバック時のみ)

*********************************************************************/

#include "test.h"

/*********************************************************************
			＠ゲームループ前に行う初期化処理
			シーンの追加などを記入してください。
*********************************************************************/
void initializationProcessBeforeLoop(ID3D11Device* device)
{
	addScene<BloomTest>(device, "a");
}

/*********************************************************************
			＠更新処理
			シーンマネージャーの更新処理とは別に実行されます。
			常時更新したい処理はこちらに記入してください。
*********************************************************************/
void updateProcess(float elapsed_time)
{
}

/*********************************************************************
			＠描画処理
			シーンマネージャーの描画処理とは別に実行されます。
			常時描画したい処理はこちらに記入してください。
*********************************************************************/
void drawingProcess(ID3D11DeviceContext* immediate_context, float elapsed_time)
{

}

/*********************************************************************
			＠ループ終了後の終了処理
			解放処理などをこちらに記入してください。
*********************************************************************/
void endProcessAfterTheLoopEnds()
{
}

#ifdef _DEBUG
/*********************************************************************
						デバック用
*********************************************************************/

/*********************************************************************
			＠ゲームループ前に行うデバック用の初期化処理
			シーンの追加などを記入してください。
*********************************************************************/
void debugModeInitializationProcessBeforeLoop(ID3D11Device* device)
{
}

/*********************************************************************
			＠デバック用の更新処理
			シーンマネージャーの更新処理とは別に実行されます。
			常時更新したい処理はこちらに記入してください。
*********************************************************************/
void debugModeUpdateProcess(float elapsed_time)
{
}

/*********************************************************************
			＠デバック用の描画処理
			シーンマネージャーの描画処理とは別に実行されます。
			常時描画したい処理はこちらに記入してください。
*********************************************************************/
void debugModeDrawingProcess(ID3D11DeviceContext* immediate_context, float elapsed_time)
{
}

/*********************************************************************
			＠ループ終了後のデバック用の終了処理
			解放処理などをこちらに記入してください。
*********************************************************************/
void debugModeEndProcessAfterTheLoopEnds()
{
}
#endif // _DEBUG